In [3]:
import pandas as pd
df = pd.read_csv("part1_employees.csv")
print(df.head())

   emp_id   name  city   dept   level   hire_date  salary_mxn  perf_score  \
0     101    Ana  CDMX  Sales  Senior  2025-11-15       48000        0.90
1     102   Luis   GDL  Sales  Junior  2026-01-10       22000        0.82
2     103  Marta   MTY    Ops     Mid  2024-06-01       32000        0.75
3     104  Jorge  CDMX    Ops  Senior  2023-03-20       51000        0.88
4     105  Sofia   QRO     HR     Mid  2022-09-05       30000        0.93

   projects  warnings  absences
0        12         1         2
1         5         0         0
2         8         1         1
3        10         0         0
4         6         0         0

In [11]:
x=(df['dept']=="Eng")&(df['perf_score'] >= 0.85)
df.loc[x,['emp_id','name','city','perf_score','salary_mxn']]

    emp_id   name  city  perf_score  salary_mxn
6      107  Karla   MTY        0.95       40000
11     112  Ramon  CDMX        0.92       90000

In [28]:
df.iloc[3:8,[0,1,5,6]]

   emp_id   name   hire_date  salary_mxn
3     104  Jorge  2023-03-20       51000
4     105  Sofia  2022-09-05       30000
5     106  Diego  2021-02-14       78000
6     107  Karla  2025-07-01       40000
7     108  Pedro  2020-10-30       35000

In [17]:
city=["CDMX","GDL"]
df.query("emp_id and city == @city and warnings == 0 and abcenses <= 1)

SyntaxError: unterminated string literal (detected at line 2) (1090854385.py, line 2)

In [20]:
city_list = ["CDMX", "GDL"]
filtered = df.loc[
    (df["city"].isin(city_list)) &
    (df["warnings"] == 0) &
    (df["absences"] <= 1),
    ["emp_id", "name", "city", "warnings", "absences"]
]
print(filtered)

    emp_id      name  city  warnings  absences
1      102      Luis   GDL         0         0
3      104     Jorge  CDMX         0         0
11     112     Ramon  CDMX         0         1
16     117  Fernanda  CDMX         0         0

In [26]:
cities = ["CDMX", "GDL"]
filtered_df = df.query(
    "city in @cities and warnings == 0 and absences <= 1"
)[["emp_id", "name", "city", "warnings", "absences"]]
print(filtered_df)

    emp_id      name  city  warnings  absences
1      102      Luis   GDL         0         0
3      104     Jorge  CDMX         0         0
11     112     Ramon  CDMX         0         1
16     117  Fernanda  CDMX         0         0

In [ ]:
resp5=(
    df.groupby
)